In [1]:
# https://tidyr.tidyverse.org/reference/replace_na.html
%run nb_helpers.py

from datar.all import *

nb_header(replace_na)

### <div style="background-color: #EEE; padding: 5px 0 8px 0">â˜… replace_na</div>

##### Replace NA with a value

This function can be also used not as a verb. As a function called as
an argument in a verb, data is passed implicitly. Then one could
pass data_or_replace as the data to replace.

##### Args:
&emsp;&emsp;`data`: The data piped in
&emsp;&emsp;`data_or_replace`: When called as argument of a verb, this is the
&emsp;&emsp;&emsp;&emsp;data to replace. Otherwise this is the replacement.

&emsp;&emsp;`replace`: The value to replace with
&emsp;&emsp;&emsp;&emsp;Can only be a scalar or dict for data frame.
&emsp;&emsp;&emsp;&emsp;So replace NA with a list is not supported yet.

##### Returns:
&emsp;&emsp;Corresponding data with NAs replaced

In [2]:
df = tibble(x = c(1, 2, NA), y = c("a", NA, "b"))
df >> replace_na(dict(x = 0, y = "unknown"))

          x        y
  <float64> <object>
0       1.0        a
1       2.0  unknown
2       0.0        b

In [3]:
df >> mutate(x = replace_na(f.x, 0))

          x        y
  <float64> <object>
0       1.0        a
1       2.0      NaN
2       0.0        b

In [4]:
df.x >> replace_na(0)

0    1.0
1    2.0
2    0.0
Name: x, dtype: float64

In [5]:
df.y >> replace_na("unknown")

0          a
1    unknown
2          b
Name: y, dtype: object

In [6]:
df_list = tibble(z = [seq(1,5), NULL, seq(10,20)])
df_list >> replace_na({'z': 5}) # replace with a list not supported yet

                                              z
                                       <object>
0                               [1, 2, 3, 4, 5]
1                                             5
2  [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]